In [2]:
import numpy as np
import pandas as pd

In [9]:
data1={'regiment':['nk','nk','nk','dg','dg','sco','sco','sco','sco'],
       'company':['1','2','1','1','3','3','2','2','1'],
       'deaths':[50,30,25,300,90,120,100,75,98],
       'origin':['Alaska','LA','Texas','California','Florida','Oregon','Georgia','Maine','Lowa'],
       'veterans':[23,32,40,13,15,36,12,13,14]}

In [10]:
data1

{'regiment': ['nk', 'nk', 'nk', 'dg', 'dg', 'sco', 'sco', 'sco', 'sco'],
 'company': ['1', '2', '1', '1', '3', '3', '2', '2', '1'],
 'deaths': [50, 30, 25, 300, 90, 120, 100, 75, 98],
 'origin': ['Alaska',
  'LA',
  'Texas',
  'California',
  'Florida',
  'Oregon',
  'Georgia',
  'Maine',
  'Lowa'],
 'veterans': [23, 32, 40, 13, 15, 36, 12, 13, 14]}

In [21]:
army=pd.DataFrame(data1)

In [22]:
army

  regiment company  deaths      origin  veterans
0       nk       1      50      Alaska        23
1       nk       2      30          LA        32
2       nk       1      25       Texas        40
3       dg       1     300  California        13
4       dg       3      90     Florida        15
5      sco       3     120      Oregon        36
6      sco       2     100     Georgia        12
7      sco       2      75       Maine        13
8      sco       1      98        Lowa        14

In [23]:
army=army.set_index('origin') #set origin as index

In [24]:
army

           regiment company  deaths  veterans
origin
Alaska           nk       1      50        23
LA               nk       2      30        32
Texas            nk       1      25        40
California       dg       1     300        13
Florida          dg       3      90        15
Oregon          sco       3     120        36
Georgia         sco       2     100        12
Maine           sco       2      75        13
Lowa            sco       1      98        14

In [25]:
print(army['veterans'])

origin
Alaska        23
LA            32
Texas         40
California    13
Florida       15
Oregon        36
Georgia       12
Maine         13
Lowa          14
Name: veterans, dtype: int64

In [26]:
print(army['veterans'],army['deaths'])

origin
Alaska        23
LA            32
Texas         40
California    13
Florida       15
Oregon        36
Georgia       12
Maine         13
Lowa          14
Name: veterans, dtype: int64 origin
Alaska         50
LA             30
Texas          25
California    300
Florida        90
Oregon        120
Georgia       100
Maine          75
Lowa           98
Name: deaths, dtype: int64

In [28]:
print(army.columns) #name of all columns

Index(['regiment', 'company', 'deaths', 'veterans'], dtype='object')

In [37]:
print(army[army.index=='Maine'].deaths,army[army.index=='Alaska'].deaths)

origin
Maine    75
Name: deaths, dtype: int64 origin
Alaska    50
Name: deaths, dtype: int64

In [41]:
army.iloc[3:8,1:3] # select rows 3 to7 and columns 1 and 2

           company  deaths
origin
California       1     300
Florida          3      90
Oregon           3     120
Georgia          2     100
Maine            2      75

In [43]:
army.iloc[4:,:] #all rows after the 4th row and all columns selected

        regiment company  deaths  veterans
origin
Florida       dg       3      90        15
Oregon       sco       3     120        36
Georgia      sco       2     100        12
Maine        sco       2      75        13
Lowa         sco       1      98        14

In [45]:
army.loc[army.deaths>50] # select rows where army.deaths is greater than 50

           regiment company  deaths  veterans
origin
California       dg       1     300        13
Florida          dg       3      90        15
Oregon          sco       3     120        36
Georgia         sco       2     100        12
Maine           sco       2      75        13
Lowa            sco       1      98        14

In [51]:
army1=army['deaths']

In [52]:
army1

origin
Alaska         50
LA             30
Texas          25
California    300
Florida        90
Oregon        120
Georgia       100
Maine          75
Lowa           98
Name: deaths, dtype: int64

In [58]:
army1[(army1>500)|(army1<50)]

origin
LA       30
Texas    25
Name: deaths, dtype: int64

In [60]:
army[army.regiment=='dg']  # regiments named Dragoons or dg

           regiment company  deaths  veterans
origin
California       dg       1     300        13
Florida          dg       3      90        15

In [67]:
army[(army.index=='Texas')|(army.index=='Florida')]

        regiment company  deaths  veterans
origin
Texas         nk       1      25        40
Florida       dg       3      90        15

In [72]:
army2=army[army.index=='Florida']

In [74]:
army2.iloc[:,2:3] #select 3rd cell in the row named Florida

         deaths
origin
Florida      90

In [76]:
army3=army.deaths

In [78]:
army3

origin
Alaska         50
LA             30
Texas          25
California    300
Florida        90
Oregon        120
Georgia       100
Maine          75
Lowa           98
Name: deaths, dtype: int64

In [81]:
army3[2]

25